ИС_СПОРТ_2022/src/DataProcessors/ЗаписьВКадровуюИсторию/ЗаписьВКадровуюИсторию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаписьВКадровуюИсторию</name>
</mdclass:DataProcessor>

ИС_СПОРТ_2022/src/InformationRegisters/СоответствияФизическихЛицИОрганизаций/СоответствияФизическихЛицИОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияФизическихЛицИОрганизаций</name>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/КадровыеИсторииТренеров/КадровыеИсторииТренеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадровыеИсторииТренеров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ТренерПреподователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ВидЗанятости/ВидЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЗанятости</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/DataProcessors/ЗаписьВКадровуюИсторию/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тренеры.Ссылка КАК Ссылка,
		|	Тренеры.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_Тренеры
		|ИЗ
		|	Справочник.Тренеры КАК Тренеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Тренеры.Ссылка КАК Ссылка,
		|	СоответствияФизическихЛицИОрганизаций.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Организация
		|ИЗ
		|	ВТ_Тренеры КАК ВТ_Тренеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		|		ПО ВТ_Тренеры.ФизическоеЛицо = СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Организация.Ссылка КАК Ссылка,
		|	ВТ_Организация.Организация КАК Организация,
		|	КадровыеИсторииТренеровСрезПоследних.Тренер КАК Тренер
		|ПОМЕСТИТЬ ВТ_Конечные
		|ИЗ
		|	ВТ_Организация КАК ВТ_Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеИсторииТренеров.СрезПоследних КАК КадровыеИсторииТренеровСрезПоследних
		|		ПО ВТ_Организация.Ссылка = КадровыеИсторииТренеровСрезПоследних.Тренер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Конечные.Ссылка КАК Ссылка,
		|	ВТ_Конечные.Организация КАК Организация,
		|	ВТ_Конечные.Тренер КАК Тренер
		|ИЗ
		|	ВТ_Конечные КАК ВТ_Конечные
		|ГДЕ
		|	ВТ_Конечные.Тренер ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Организация.Пустая() Или Организация = ВыборкаДетальныеЗаписи.Организация Тогда
			МенеджерЗаписи = РегистрыСведений.КадровыеИсторииТренеров.СоздатьМенеджерЗаписи();
			Если Дата = Дата(1,1,1) Тогда
				МенеджерЗаписи.Период = НачалоДня(ТекущаяДатаСеанса());
			Иначе
				МенеджерЗаписи.Период = Дата;
			КонецЕсли;
			МенеджерЗаписи.Тренер = ВыборкаДетальныеЗаписи.Ссылка;
			МенеджерЗаписи.Организация = ВыборкаДетальныеЗаписи.Организация;
			МенеджерЗаписи.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием;
			Если ВидЗанятости = Перечисления.ВидЗанятости.ПустаяСсылка() Тогда
				МенеджерЗаписи.ВидЗанятости = Перечисления.ВидЗанятости.ОсновноеМестоРаботы;
			Иначе
				МенеджерЗаписи.ВидЗанятости = ВидЗанятости;
			КонецЕсли;
			МенеджерЗаписи.Записать();
			Попытка
				Работник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДетальныеЗаписи.Ссылка)
			Исключение
				Работник = ВыборкаДетальныеЗаписи.Ссылка;
			КонецПопытки;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Создана запись в кадровой истории сотрудника %1.'"),
						Работник);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
				    
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
